3DJet_template_rhosimple/system/blockMeshDict
FoamFile{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 0.001;

vertices
(
    (0 -10 -10)
    (0 -10 10)
    (0 10 -10)
    (0 10 10)
    (30 -10 -10)
    (30 -10 10)
    (30 10 -10)
    (30 10 10)
);
blocks
(
    hex (0 4 6 2 1 5 7 3)
    (10 10 10)
    SimpleGrading (1 1 1)
);
edges
(
);


boundary
(
    inlet              // patch name
    {
        type patch;    // patch type for patch 0
        faces
        (
            (0 1 3 2)  // block face in this patch
        );
    }                  // end of 0th patch definition

    outlet             // patch name
    {
        type patch;    // patch type for patch 1
        faces
        (
            (4 6 7 5)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (3 7 6 2)
            (0 2 6 4)
            (1 5 7 3)
        );
    }
);
