3DJet_template_rhosimple/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (144 0 0);            //uniform (288 0 0);
        // value           uniform (852 0 0);            //uniform (0 0 852);
    }

    outlet
    {
        type            zeroGradient;
    }

    gasjet
    {
        type            slip;
    }

    chamber
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
