3DJet_template_rhosimple/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication snappyHexMesh
cp 0/* 2e-09/

runApplication rhoSimpleFoam
#runApplication decomposePar
#runParallel dsmcInitialise
#runParallel $(getApplication)
#runApplication reconstructPar -noLagrangian

#------------------------------------------------------------------------------
